
	//============================
	////コンテンツ内アコーディオン CLOSEボタン
	//============================
	document.addEventListener('DOMContentLoaded', function() {

		// 見積もり実行
		var exec_estimate = function(){
			var breed = String(document.getElementById("petBreed").value);
			var age = document.getElementById("petAge").value;

			if(!!!breed || !!!age){
				return false;
			}
			var price_type = pet_breed[breed][2];
			var price_list = pet_prices[price_type - 1][age];
			var price_list_t = pet_prices_t[price_type - 1][age];
			
			let group1 = document.getElementsByName('group1');
			let len = group1.length;
			let checkValue = '';
			for (let i = 0; i < len; i++){
				if (group1.item(i).checked){
					checkValue = group1.item(i).value;
				}
			}
			//月払い
			if(checkValue == 1){
				document.getElementById('ari_70').innerHTML = price_list_t[2];
				document.getElementById('ari_50').innerHTML = price_list_t[0];
				document.getElementById('nashi_70').innerHTML = price_list[2];
				document.getElementById('nashi_50').innerHTML = price_list[0];

			//一時払
			}else{
				document.getElementById('ari_70').innerHTML = price_list_t[3];
				document.getElementById('ari_50').innerHTML = price_list_t[1];
				document.getElementById('nashi_70').innerHTML = price_list[3];
				document.getElementById('nashi_50').innerHTML = price_list[1];
			}
		};


		//保険料見積もり関連
		//===============================
		document.querySelectorAll("#petBreed").forEach((tab) => {
			document.addEventListener("change", function (event) {
				var breed = document.getElementById("petBreed").value;
				price_list = ["―","―","―","―"];
				document.getElementById('ari_70').innerHTML = price_list[0];
				document.getElementById('ari_50').innerHTML = price_list[1];
				document.getElementById('nashi_70').innerHTML = price_list[2];
				document.getElementById('nashi_50').innerHTML = price_list[3];
				document.getElementById('pet_price_button').classList.remove('is-active');
				document.getElementById('pet_price_detail').style.display = "none";
			});
		});
		document.querySelectorAll("#petAge").forEach((tab) => {
			document.addEventListener("change", function (event) {
			
				price_list = ["―","―","―","―"];
				document.getElementById('ari_70').innerHTML = price_list[0];
				document.getElementById('ari_50').innerHTML = price_list[1];
				document.getElementById('nashi_70').innerHTML = price_list[2];
				document.getElementById('nashi_50').innerHTML = price_list[3];
				document.getElementById('pet_price_button').classList.remove('is-active');
				document.getElementById('pet_price_detail').style.display = "none";


			});
		});
		document.querySelectorAll(".group1").forEach((tab) => {
			document.addEventListener("change", function (event) {
				price_list = ["―","―","―","―"];
				document.getElementById('ari_70').innerHTML = price_list[0];
				document.getElementById('ari_50').innerHTML = price_list[1];
				document.getElementById('nashi_70').innerHTML = price_list[2];
				document.getElementById('nashi_50').innerHTML = price_list[3];
				document.getElementById('pet_price_button').classList.remove('is-active');
				document.getElementById('pet_price_detail').style.display = "none";
			});
		});
		document.querySelectorAll("#pet_price_button").forEach((tab) => {
			document.addEventListener("click", function (event) {
				var breed = document.getElementById("petBreed").value;
				var age = document.getElementById("petAge").value;
				if(breed == "" || age == ""){
					price_list = ["―","―","―","―"];
					document.getElementById('ari_70').innerHTML = price_list[0];
					document.getElementById('ari_50').innerHTML = price_list[1];
					document.getElementById('nashi_70').innerHTML = price_list[2];
					document.getElementById('nashi_50').innerHTML = price_list[3];
					document.getElementById('price_button').classList.remove('is-active');
					document.getElementById('pet_price_detail').style.display = "none";
				}else{
					exec_estimate();
				}
			});
		});
    });



	var pet_prices = [
		// 犬 10kg未満
		//コース50月払,コース50一時払,コース70月払,コース70一時払
		[
			["990","10,760","1,240","13,530"],
			["920","10,080","1,150","12,580"],
			["860","9,410","1,070","11,640"],
			["960","10,500","1,210","13,160"],
			["1,060","11,580","1,350","14,680"],
			["1,160","12,660","1,480","16,190"],
			["1,460","15,950","1,910","20,800"],
			["1,760","19,220","2,330","25,380"],
			["2,060","22,510","2,750","29,980"],
			["2,340","25,480","3,130","34,140"],
			["2,610","28,450","3,510","38,300"]
		],
		// 犬 10kg以上
		[
			["1,700","18,560","2,240","24,450"],
			["1,560","16,980","2,040","22,230"],
			["1,410","15,410","1,840","20,040"],
			["1,580","17,270","2,080","22,650"],
			["1,760","19,150","2,320","25,270"],
			["1,930","21,000","2,550","27,870"],
			["2,490","27,150","3,340","36,470"],
			["3,050","33,280","4,130","45,060"],
			["3,610","39,430","4,920","53,660"],
			["4,140","45,200","5,660","61,750"],
			["4,670","50,990","6,400","69,860"]
		],
		// 犬 20kg以上
		[
			["1,870","20,390","2,480","27,010"],
			["1,710","18,650","2,250","24,570"],
			["1,550","16,920","2,030","22,160"],
			["1,740","19,010","2,300","25,080"],
			["1,940","21,120","2,570","28,030"],
			["2,130","23,200","2,840","30,950"],
			["2,770","30,180","3,730","40,710"],
			["3,400","37,140","4,630","50,470"],
			["4,040","44,120","5,520","60,230"],
			["4,650","50,680","6,360","69,420"],
			["5,250","57,260","7,210","78,630"]
		],
		// 猫
		[
			["880","9,620","1,090","11,930"],
			["860","9,350","1,060","11,560"],
			["830","9,100","1,030","11,210"],
			["900","9,860","1,120","12,270"],
			["970","10,630","1,220","13,350"],
			["1,040","11,400","1,320","14,420"],
			["1,210","13,240","1,560","17,000"],
			["1,380","15,080","1,790","19,580"],
			["1,550","16,930","2,030","22,160"],
			["1,860","20,280","2,460","26,860"],
			["2,170","23,640","2,890","31,560"]
		]
	];
	
	//料金表（通院あり）
	var pet_prices_t = [
		// 犬 10kg未満
		[
			["1,930","20,980","2,480","27,070"],
			["1,810","19,750","2,320","25,360"],
			["1,700","18,540","2,170","23,660"],
			["1,910","20,880","2,470","26,930"],
			["2,130","23,210","2,770","30,200"],
			["2,340","25,540","3,060","33,460"],
			["2,910","31,770","3,870","42,190"],
			["3,480","37,980","4,670","50,880"],
			["4,050","44,210","5,470","59,600"],
			["4,650","50,630","6,290","68,580"],
			["5,230","57,040","7,110","77,560"]
		],
		// 犬 10kg以上
		[
			["3,130","34,190","4,170","45,560"],
			["2,970","32,330","3,940","42,960"],
			["2,790","30,490","3,710","40,390"],
			["3,090","33,750","4,120","44,950"],
			["3,400","37,030","4,540","49,530"],
			["3,700","40,270","4,950","54,090"],
			["4,470","48,800","6,050","66,010"],
			["5,250","57,300","7,140","77,930"],
			["6,030","65,830","8,240","89,850"],
			["6,940","75,770","9,510","103,780"],
			["7,850","85,730","10,790","117,730"]
		],
		// 犬 20kg以上
		[
			["3,720","40,580","5,000","54,510"],
			["3,470","37,850","4,640","50,690"],
			["3,220","35,130","4,300","46,880"],
			["3,610","39,380","4,840","52,840"],
			["4,010","43,660","5,390","58,820"],
			["4,390","47,900","5,940","64,770"],
			["5,330","58,110","7,240","79,040"],
			["6,260","68,290","8,560","93,310"],
			["7,190","78,500","9,860","107,590"],
			["8,350","91,030","11,470","125,150"],
			["9,500","103,590","13,090","142,720"]
		],
		// 猫
		[
			["1,690","18,470","2,160","23,550"],
			["1,650","17,960","2,090","22,850"],
			["1,600","17,470","2,030","22,170"],
			["1,750","19,130","2,240","24,480"],
			["1,900","20,800","2,450","26,820"],
			["2,050","22,460","2,670","29,140"],
			["2,310","25,260","3,030","33,060"],
			["2,570","28,050","3,380","36,980"],
			["2,830","30,860","3,750","40,890"],
			["3,330","36,290","4,440","48,500"],
			["3,830","41,730","5,140","56,120"]
		]
	];
// 品種コード[品種コード,品種名,料率区分,ペット種類]
	var pet_breed = {
		"001":["001","アーフェンピンシャー","1","1"],
		"002":["002","アイリッシュ・ウルフハウンド","3","1"],
		"003":["003","アイリッシュ・セター","3","1"],
		"004":["004","アイリッシュ・ソフトコーテッド・ウィートン・テリア","2","1"],
		"005":["005","秋田","3","1"],
		"006":["006","アフガン・ハウンド","3","1"],
		"007":["007","アメリカン・アキタ","3","1"],
		"008":["008","アメリカン・コッカー・スパニエル","2","1"],
		"009":["009","アメリカン・スタッフォードシャー・テリア","2","1"],
		"010":["010","アメリカン・フォックスハウンド","3","1"],
		"011":["011","アラスカン・マラミュート","3","1"],
		"012":["012","イタリアン・グレーハウンド","2","1"],
		"013":["013","イングリッシュ・コッカー・スパニエル","2","1"],
		"014":["014","イングリッシュ・スプリンガー・スパニエル","3","1"],
		"015":["015","イングリッシュ・セター","3","1"],
		"016":["016","イングリッシュ・ポインター","3","1"],
		"017":["017","ウィペット","2","1"],
		"018":["018","ウエスト・ハイランド・ホワイト・テリア","2","1"],
		"019":["019","ウェルシュ・コーギー・カーディガン","1","1"],
		"020":["020","ウェルシュ・コーギー・ペンブローク","1","1"],
		"021":["021","ウェルシュ・テリア","1","1"],
		"022":["022","エアデール・テリア","3","1"],
		"023":["023","オーストラリアン・キャトルドッグ","2","1"],
		"024":["024","オーストラリアン・ケルピー","2","1"],
		"025":["025","オーストラリアン・シェパード","3","1"],
		"026":["026","オーストラリアン・シルキー・テリア","1","1"],
		"027":["027","オーストラリアン・テリア","1","1"],
		"028":["028","オールド・イングリッシュ・シープドッグ","3","1"],
		"029":["029","カニーンヘン・ダックスフンド","1","1"],
		"030":["030","カーリーコーテッド・レトリーバー","3","1"],
		"031":["031","甲斐","2","1"],
		"032":["032","キースホンド","2","1"],
		"033":["033","紀州","3","1"],
		"034":["034","キャバリア・キング・チャールズ・スパニエル","2","1"],
		"035":["035","キング・チャールズ・スパニエル","1","1"],
		"036":["036","グレート・デーン","3","1"],
		"037":["037","グレート・ピレニーズ","3","1"],
		"038":["038","グレーハウンド","3","1"],
		"039":["039","クロアチアン・シープドッグ","2","1"],
		"040":["040","ケアーン・テリア","1","1"],
		"041":["041","ケリー・ブルー・テリア","2","1"],
		"042":["042","コーイケルホンディエ","1","1"],
		"043":["043","ゴードン・セター","3","1"],
		"044":["044","ゴールデン・レトリーバー","3","1"],
		"045":["045","コリー","3","1"],
		"046":["046","サモエド","3","1"],
		"047":["047","サルーキ","3","1"],
		"048":["048","シー・ズー","1","1"],
		"049":["049","シーリハム・テリア","1","1"],
		"050":["050","シェットランド・シープドッグ","2","1"],
		"051":["051","四国","3","1"],
		"052":["052","柴","1","1"],
		"053":["053","シベリアン・ハスキー","3","1"],
		"054":["054","シャー・ペイ","3","1"],
		"055":["055","ジャーマン・シェパード・ドッグ","3","1"],
		"056":["056","ジャーマン・ハンティング・テリア","2","1"],
		"057":["057","ジャーマン・ポインター","3","1"],
		"058":["058","ジャイアント・シュナウザー","3","1"],
		"059":["059","ジャック・ラッセル・テリア","1","1"],
		"060":["060","ショートヘアード・ハンガリアン・ビズラ","3","1"],
		"061":["061","スカイ・テリア","2","1"],
		"062":["062","スキッパーキ","1","1"],
		"063":["063","スコティッシュ・テリア","2","1"],
		"064":["064","スタッフォードシャー・ブル・テリア","2","1"],
		"065":["065","スタンダード・シュナウザー","2","1"],
		"066":["066","セント・バーナード","3","1"],
		"067":["067","ダックスフンド(カニーンヘン・ミニチュア)","1","1"],
		"068":["068","ダックスフンド（スタンダード)","2","1"],
		"069":["069","ダルメシアン","3","1"],
		"070":["070","ダンディ・ディンモント・テリア","1","1"],
		"071":["071","チェサピーク・ベイ・レトリーバー","3","1"],
		"072":["072","チベタン・スパニエル","1","1"],
		"073":["073","チベタン・テリア","2","1"],
		"074":["074","チベタン・マスティフ","3","1"],
		"075":["075","チャイニーズ・クレステッド・ドッグ","1","1"],
		"076":["076","チャウ・チャウ","3","1"],
		"077":["077","チワワ","1","1"],
		"078":["078","狆","1","1"],
		"079":["079","トイ・プードル","1","1"],
		"080":["080","トイ・マンチェスター・テリア","1","1"],
		"081":["081","ドーベルマン","3","1"],
		"082":["082","ドゴ・アルヘンティーノ","3","1"],
		"083":["083","ドゴ・カナリオ","3","1"],
		"084":["084","土佐","3","1"],
		"085":["085","ナポリタン・マスティフ","3","1"],
		"086":["086","ニューファンドランド","3","1"],
		"087":["087","日本スピッツ","1","1"],
		"088":["088","日本テリア","1","1"],
		"089":["089","ノーフォーク・テリア","1","1"],
		"090":["090","ノーリッチ・テリア","1","1"],
		"091":["091","パーソン・ラッセル・テリア","1","1"],
		"092":["092","バーニーズ・マウンテン・ドッグ","3","1"],
		"093":["093","パグ","2","1"],
		"094":["094","バセット・ハウンド","3","1"],
		"095":["095","バセンジー","1","1"],
		"096":["096","ハバニーズ","1","1"],
		"097":["097","パピヨン","1","1"],
		"098":["098","ハリア","3","1"],
		"099":["099","ビアデッド・コリー","3","1"],
		"100":["100","ビーグル","2","1"],
		"101":["101","ビション・フリーゼ","2","1"],
		"102":["102","ピレニアン・シープドッグ","2","1"],
		"103":["103","ピレニアン・マスティフ","3","1"],
		"104":["104","プードル(トイ・ミニチュア)","1","1"],
		"105":["105","プードル（ミディアム・スタンダード)","2","1"],
		"106":["106","ブービエ・デ・フランダース","3","1"],
		"107":["107","プーリー","2","1"],
		"108":["108","プチ・バセット・グリフォン・バンデーン","2","1"],
		"109":["109","プチ・ブラバンソン","2","1"],
		"110":["110","フラットコーテッド・レトリーバー","3","1"],
		"111":["111","ブリアード","3","1"],
		"112":["112","ブリタニー・スパニエル","2","1"],
		"113":["113","ブリュッセル・グリフォン","1","1"],
		"114":["114","ブル・テリア","3","1"],
		"115":["115","ブルドッグ","3","1"],
		"116":["116","ブルマスティフ","3","1"],
		"117":["117","フレンチ・ブルドッグ","2","1"],
		"118":["118","ペキニーズ","2","1"],
		"119":["119","ベドリントン・テリア","1","1"],
		"120":["120","ベルジアン・グリフォン","1","1"],
		"121":["121","ベルジアン・シェパード・ドッグ・グローネンダール","3","1"],
		"122":["122","ベルジアン・シェパード・ドッグ・タービュレン","3","1"],
		"123":["123","ベルジアン・シェパード・ドッグ・マリノア","3","1"],
		"124":["124","ベルジアン・シェパード・ドッグ・ラケノア","3","1"],
		"125":["125","ボーダー・コリー","2","1"],
		"126":["126","ボーダー・テリア","1","1"],
		"127":["127","ポーチュギーズ・ウォーター･ドッグ","2","1"],
		"128":["128","ボクサー","3","1"],
		"129":["129","ボストン・テリア","2","1"],
		"130":["130","北海道","2","1"],
		"131":["131","ポメラニアン","1","1"],
		"132":["132","ポリッシュ・ローランド・シープドッグ","2","1"],
		"133":["133","ボルゾイ","3","1"],
		"134":["134","ボルドー・マスティフ","3","1"],
		"135":["135","ボロニーズ","1","1"],
		"136":["136","ホワイト・スイス・シェパード・ドッグ","3","1"],
		"137":["137","マスティフ","3","1"],
		"138":["138","マルチーズ","1","1"],
		"139":["139","マンチェスター・テリア","1","1"],
		"140":["140","ミニチュア・シュナウザー","1","1"],
		"141":["141","ミニチュア・ダックスフンド","1","1"],
		"142":["142","ミニチュア・ピンシャー","2","1"],
		"143":["143","ミニチュア・プードル","1","1"],
		"144":["144","ミニチュア・ブル・テリア","2","1"],
		"145":["145","ヨークシャー・テリア","1","1"],
		"146":["146","ラージ・ミュンスターレンダー","3","1"],
		"147":["147","ラサ・アプソ","2","1"],
		"148":["148","ラブラドール・レトリーバー","3","1"],
		"149":["149","レークランド・テリア","1","1"],
		"150":["150","レオンベルガー","3","1"],
		"151":["151","ローデシアン・リジバック","3","1"],
		"152":["152","ロシアン・トイ","1","1"],
		"153":["153","ロットワイラー","3","1"],
		"154":["154","ワイアー・フォックス・テリア","2","1"],
		"155":["155","ワイマラナー","3","1"],
		"300":["300","混血犬(10kg未満)","1","1"],
		"301":["301","混血犬(10kg以上20kg未満)","2","1"],
		"302":["302","混血犬(20kg以上)","3","1"],
		"400":["400","アビシニアン","4","2"],
		"401":["401","アメリカン・カール","4","2"],
		"402":["402","アメリカン・カール・ショートヘア","4","2"],
		"403":["403","アメリカン・カール・ロングヘア","4","2"],
		"404":["404","アメリカン・ショートヘア","4","2"],
		"405":["405","アメリカン・ボブテイル","4","2"],
		"406":["406","アメリカン・ボブテイル・ショートヘア","4","2"],
		"407":["407","アメリカン・ワイヤーヘア","4","2"],
		"408":["408","エキゾチック","4","2"],
		"409":["409","エキゾチック・ショートヘア","4","2"],
		"410":["410","エジプシャン・マウ","4","2"],
		"411":["411","オシキャット","4","2"],
		"412":["412","オホースアズーレス","4","2"],
		"413":["413","オホースアズーレス・ロングヘア","4","2"],
		"414":["414","オリエンタル","4","2"],
		"415":["415","オリエンタル・ショートヘア","4","2"],
		"416":["416","オリエンタル・ロングヘア","4","2"],
		"417":["417","カラーポイント・ショートヘア","4","2"],
		"418":["418","カリフォルニアスパングルド","4","2"],
		"419":["419","キムリック","4","2"],
		"420":["420","クリル・アイランド・ボブテイル","4","2"],
		"421":["421","コーニッシュ・レックス","4","2"],
		"422":["422","コラット","4","2"],
		"423":["423","サイベリアン","4","2"],
		"424":["424","サバンナ","4","2"],
		"425":["425","ジャバニーズ","4","2"],
		"426":["426","ジャパニーズ・ボブテイル","4","2"],
		"427":["427","ジャパニーズ・ボブテイル・ロングヘア","4","2"],
		"428":["428","シャム","4","2"],
		"429":["429","シャルトリュー","4","2"],
		"430":["430","シャンティリィ/ティファニー","4","2"],
		"431":["431","シンガプーラ","4","2"],
		"432":["432","スコティッシュ・フォールド","4","2"],
		"433":["433","スコティッシュ・フォールド・ロングヘア","4","2"],
		"434":["434","スノーシュー","4","2"],
		"435":["435","スフィンクス","4","2"],
		"436":["436","スポッテッド・ミスト","4","2"],
		"437":["437","セルカーク・レックス","4","2"],
		"438":["438","セルカーク・レックス・ロングヘア","4","2"],
		"439":["439","セレンゲティ","4","2"],
		"440":["440","ソマリ","4","2"],
		"441":["441","ターキッシュ・アンゴラ","4","2"],
		"442":["442","ターキッシュ・バン","4","2"],
		"443":["443","チャウシー","4","2"],
		"444":["444","ティファニー","4","2"],
		"445":["445","デボン・レックス","4","2"],
		"446":["446","トイガー","4","2"],
		"447":["447","トンキニーズ","4","2"],
		"448":["448","ドンスコイ","4","2"],
		"449":["449","日本猫","4","2"],
		"450":["450","ネーベロング","4","2"],
		"451":["451","ノルウェージャン・フォレスト・キャット","4","2"],
		"452":["452","バーマン","4","2"],
		"453":["453","バーミーズ","4","2"],
		"454":["454","ハバナ","4","2"],
		"455":["455","ハバナ・ブラウン","4","2"],
		"456":["456","バリニーズ","4","2"],
		"457":["457","ピーターボールド","4","2"],
		"458":["458","ピクシーボブ","4","2"],
		"459":["459","ピクシーボブ・ロングヘア","4","2"],
		"460":["460","ヒマラヤン","4","2"],
		"461":["461","ブリティッシュ・ショートヘアー","4","2"],
		"462":["462","ブリティッシュ・ロングヘア","4","2"],
		"463":["463","ペルシャ","4","2"],
		"464":["464","ペルシャ(チンチラ)","4","2"],
		"465":["465","ベンガル","4","2"],
		"466":["466","ボンベイ","4","2"],
		"467":["467","マンクス","4","2"],
		"468":["468","マンチカン","4","2"],
		"469":["469","マンチカン・ロングヘアー","4","2"],
		"470":["470","メイン・クーン","4","2"],
		"471":["471","ヨーロピアン・ショートヘアー","4","2"],
		"472":["472","ヨーロピアン・バーミーズ","4","2"],
		"473":["473","ラ・パーム","4","2"],
		"474":["474","ラ・パーム・ショートヘア","4","2"],
		"475":["475","ラガマフィン","4","2"],
		"476":["476","ラグドール","4","2"],
		"477":["477","ロシアンブルー","4","2"],
		"999":["999","猫","4","2"] //見積もり用
	};



